Repository: JovannyRch/tablas_de_verdad_2025
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, hi, it, ja, pt, ru

source: Watch Video (Free)
de: Video ansehen (Kostenlos)
es: Ver Video (Gratis)
fr: Voir la vidéo (Gratuit)
hi: वीडियो देखें (मुफ्त)
it: Guarda Video (Gratis)
ja: ビデオを見る（無料）
pt: Ver Vídeo (Grátis)
ru: Смотреть видео (Бесплатно)

source: YouTube Channel
de: YouTube-Kanal
es: Canal de YouTube
fr: Chaîne YouTube
hi: YouTube चैनल
it: Canale YouTube
ja: YouTubeチャンネル
pt: Canal do YouTube
ru: YouTube канал

source: Favorites
de: Favoriten
es: Favoritos
fr: Favoris
hi: पसंदीदा
it: Preferiti
ja: お気に入り
pt: Favoritos
ru: Избранное

# noFavorites
source: No favorites yet
de: Keine Favoriten
es: Sin favoritos
fr: Pas de favoris
hi: कोई पसंदीदा नहीं
it: Nessun preferito
ja: お気に入りなし
pt: Sem favoritos
ru: Нет избранного

source: Added to favorites
de: Zu Favoriten hinzugefügt
es: Agregado a favoritos
fr: Ajouté aux favoris
hi: पसंदीदा में जोड़ा गया
it: Aggiunto ai preferiti
ja: お気に入りに追加しました
pt: Adicionado aos favoritos
ru: Добавлено в избранное

source: Removed from favorites
de: Aus Favoriten entfernt
es: Eliminado de favoritos
fr: Retiré des favoris
hi: पसंदीदा से हटाया गया
it: Rimosso dai preferiti
ja: お気に入りから削除しました
pt: Removido dos favoritos
ru: Удалено из избранного

source: Search history...
de: Verlauf durchsuchen...
es: Buscar en historial...
fr: Rechercher dans l'historique...
hi: इतिहास में खोजें...
it: Cerca nella cronologia...
ja: 履歴を検索...
pt: Pesquisar histórico...
ru: Поиск в истории...

source: All
de: Alle
es: Todos
fr: Tous
hi: सभी
it: Tutti
ja: すべて
pt: Todos
ru: Все

# onboardingTitle1
source: Write your expression
de: Schreibe deinen Ausdruck
es: Escribe tu expresión
fr: Écrivez votre expression
hi: अपनी अभिव्यक्ति लिखें
it: Scrivi la tua espressione
ja: 式を入力
pt: Escreva sua expressão
ru: Напишите выражение

# onboardingDesc1
source: Use the keypad to enter any logical expression with variables and operators
de: Verwende die Tastatur, um beliebige logische Ausdrücke mit Variablen und Operatoren einzugeben
es: Usa el teclado para ingresar cualquier expresión lógica con variables y operadores
fr: Utilisez le clavier pour saisir toute expression logique avec des variables et des opérateurs
hi: चर और ऑपरेटरों के साथ कोई भी तार्किक अभिव्यक्ति दर्ज करने के लिए कीपैड का उपयोग करें
it: Usa la tastiera per inserire qualsiasi espressione logica con variabili e operatori
ja: キーパッドを使って変数と演算子で論理式を入力
pt: Use o teclado para inserir qualquer expressão lógica com variáveis e operadores
ru: Используйте клавиатуру для ввода логического выражения с переменными и операторами

# onboardingTitle2
source: Step-by-step solution
de: Schritt-für-Schritt-Lösung
es: Solución paso a paso
fr: Solution étape par étape
hi: चरण-दर-चरण समाधान
it: Soluzione passo dopo passo
ja: ステップバイステップの解法
pt: Solução passo a passo
ru: Пошаговое решение

# onboardingDesc2
source: See each step of the resolution and the complete truth table
de: Sieh jeden Schritt der Lösung und die vollständige Wahrheitstabelle
es: Visualiza cada paso de la resolución y la tabla de verdad completa
fr: Visualisez chaque étape de la résolution et la table de vérité complète
hi: समाधान के प्रत्येक चरण और पूर्ण सत्य तालिका को देखें
it: Visualizza ogni passag della risoluzione e la tabella di verità completa
ja: 解法の各ステップと完全な真理値表を表示
pt: Visualize cada passo da resolução e a tabela verdade completa
ru: Просматривайте каждый шаг решения и полную таблицу истинности

# onboardingTitle3
source: Export and share
de: Exportieren und teilen
es: Exporta y comparte
fr: Exportez et partagez
hi: निर्यात करें और साझा करें
it: Esporta e condividi
ja: エクスポートして共有
pt: Exporte e compartilhe
ru: Экспортируйте и делитесь

# onboardingDesc3
source: Generate professional PDFs and share your results easily
de: Erstelle professionelle PDFs und teile deine Ergebnisse einfach
es: Genera PDFs profesionales y comparte tus resultados fácilmente
fr: Générez des PDF professionnels et partagez vos résultats facilement
hi: पेशेवर PDF बनाएं और अपने परिणाम आसानी से साझा करें
it: Genera PDF professionali e condividi i tuoi risultati facilmente
ja: プロフェッショナルなPDFを生成し、結果を簡単に共有
pt: Gere PDFs profissionais e compartilhe seus resultados facilmente
ru: Создавайте профессиональные PDF и легко делитесь результатами

source: Get started!
de: Los geht's!
es: ¡Empezar!
fr: Commencer!
hi: शुरू करें!
it: Iniziamo!
ja: 始めよう!
pt: Começar!
ru: Начать!

source: Next
de: Weiter
es: Siguiente
fr: Suivant
hi: अगला
it: Avanti
ja: 次へ
pt: Próximo
ru: Далее

source: Skip
de: Überspringen
es: Omitir
fr: Passer
hi: छोड़ें
it: Salta
ja: スキップ
pt: Pular
ru: Пропустить

source: Practice Mode
de: Übungsmodus
es: Modo Práctica
fr: Mode Entraînement
hi: अभ्यास मोड
it: Modalità Pratica
ja: 練習モード
pt: Modo Prática
ru: Режим практики

source: Choose difficulty
de: Schwierigkeit wählen
es: Elige la dificultad
fr: Choisissez la difficulté
hi: कठिनाई चुनें
it: Scegli la difficoltà
ja: 難易度を選択
pt: Escolha a dificuldade
ru: Выберите сложность

source: Easy
de: Einfach
es: Fácil
fr: Facile
hi: आसान
it: Facile
ja: 簡単
pt: Fácil
ru: Легко

# easyDesc
source: Simple expressions with 1-2 variables
de: Einfache Ausdrücke mit 1-2 Variablen
es: Expresiones simples con 1-2 variables
fr: Expressions simples avec 1-2 variables
hi: 1-2 चर के साथ सरल अभिव्यक्तियाँ
it: Espressioni semplici con 1-2 variabili
ja: 1-2変数の簡単な式
pt: Expressões simples com 1-2 variáveis
ru: Простые выражения с 1-2 переменными

source: Medium
de: Mittel
es: Medio
fr: Moyen
hi: मध्यम
it: Medio
ja: 普通
pt: Médio
ru: Средне

# mediumDesc
source: Compound expressions with 2-3 variables
de: Zusammengesetzte Ausdrücke mit 2-3 Variablen
es: Expresiones compuestas con 2-3 variables
fr: Expressions composées avec 2-3 variables
hi: 2-3 चर के साथ यौगिक अभिव्यक्तियाँ
it: Espressioni composte con 2-3 variabili
ja: 2-3変数の複合式
pt: Expressões compostas com 2-3 variáveis
ru: Составные выражения с 2-3 переменными

source: Hard
de: Schwer
es: Difícil
fr: Difficile
hi: कठिन
it: Difficile
ja: 難しい
pt: Difícil
ru: Сложно

# hardDesc
source: Complex expressions with 3-4 variables
de: Komplexe Ausdrücke mit 3-4 Variablen
es: Expresiones complejas con 3-4 variables
fr: Expressions complexes avec 3-4 variables
hi: 3-4 चर के साथ जटिल अभिव्यक्तियाँ
it: Espressioni complesse con 3-4 variabili
ja: 3-4変数の複雑な式
pt: Expressões complexas com 3-4 variáveis
ru: Сложные выражения с 3-4 переменными

source: Your stats
de: Deine Statistiken
es: Tus estadísticas
fr: Vos statistiques
hi: आपके आँकड़े
it: Le tue statistiche
ja: あなたの統計
pt: Suas estatísticas
ru: Ваша статистика

# quizzesPlayed
source: Played
de: Gespielt
es: Jugados
fr: Joués
hi: खेले गए
it: Giocati
ja: プレイ済み
pt: Jogados
ru: Сыграно

source: Best streak
de: Beste Serie
es: Mejor racha
fr: Meilleure série
hi: सबसे अच्छी लय
it: Miglior serie
ja: ベスト連続
pt: Melhor sequência
ru: Лучшая серия

# correctAnswers
source: Correct
de: Richtig
es: Correctas
fr: Correctes
hi: सही उत्तर
it: Corrette
ja: 正解
pt: Corretas
ru: Правильных

source: Question
de: Frage
es: Pregunta
hi: प्रश्न
it: Domanda
ja: 問題
pt: Pergunta
ru: Вопрос

# whatTypeIsThis
source: What type is this expression?
de: Welcher Typ ist dieser Ausdruck?
es: ¿Qué tipo de expresión es?
fr: Quel type est cette expression ?
hi: इस अभिव्यक्ति का प्रकार क्या है?
it: Che tipo è questa espressione?
ja: この式のタイプは？
pt: Que tipo é esta expressão?
ru: Какого типа это выражение?

# correctAnswer
source: Correct! 🎉
de: Richtig! 🎉
es: ¡Correcto! 🎉
hi: सही! 🎉
it: Corretto! 🎉
ja: 正解！🎉
pt: Correto! 🎉
ru: Правильно! 🎉

# wrongAnswer
source: Incorrect. Keep trying!
de: Falsch. Weiter versuchen!
es: Incorrecto. ¡Sigue intentando!
fr: Incorrect. Continuez !
hi: गलत। कोशिश करते रहें!
it: Sbagliato. Continua a provare!
ja: 不正解。頑張って！
pt: Incorreto. Continue tentando!
ru: Неправильно. Продолжайте!

source: See results
de: Ergebnisse sehen
es: Ver resultados
fr: Voir les résultats
hi: परिणाम देखें
it: Vedi risultati
ja: 結果を見る
pt: Ver resultados
ru: Посмотреть результаты

source: Quiz Results
de: Quiz-Ergebnisse
es: Resultados del quiz
fr: Résultats du quiz
hi: क्विज़ परिणाम
it: Risultati del quiz
ja: クイズ結果
pt: Resultados do quiz
ru: Результаты теста

source: Play again
de: Nochmal spielen
es: Jugar de nuevo
fr: Rejouer
hi: फिर से खेलें
it: Gioca ancora
ja: もう一度プレイ
pt: Jogar novamente
ru: Играть снова

source: Full table
de: Vollständige Tabelle
es: Tabla completa
fr: Table complète
hi: पूर्ण तालिका
it: Tabella completa
ja: 完全な表
pt: Tabela completa
ru: Полная таблица

source: One-time purchase
de: Einmalkauf
es: Compra única
fr: Achat unique
hi: एक बार की खरीदारी
it: Acquisto una tantum
ja: 1回限りの購入
pt: Compra única
ru: Разовая покупка

# unlimitedPremiumOps
source: Unlimited premium operators
de: Unbegrenzte Premium-Operatoren
es: Operadores premium ilimitados
fr: Opérateurs premium illimités
hi: असीमित प्रीमियम ऑपरेटर
it: Operatori premium illimitati
ja: 無制限のプレミアム演算子
pt: Operadores premium ilimitados
ru: Безлимитные премиум-операторы

# supportDeveloper
source: Support the developer
de: Unterstütze den Entwickler
es: Apoya al desarrollador
fr: Soutenez le développeur
hi: डेवलपर का समर्थन करें
it: Supporta lo sviluppatore
ja: 開発者をサポート
pt: Apoie o desenvolvedor
ru: Поддержите разработчика

# socialProof
source: Trusted by thousands of students
de: Von Tausenden Studenten genutzt
es: Confiado por miles de estudiantes
fr: Utilisé par des milliers d'étudiants
hi: हजारों छात्रों द्वारा विश्वसनीय
it: Utilizzato da migliaia di studenti
ja: 何千人もの学生に信頼されています
pt: Confiado por milhares de estudantes
ru: Доверяют тысячи студентов

# purchaseError
source: Purchase failed. Please try again.
de: Kauf fehlgeschlagen. Bitte erneut versuchen.
es: Error en la compra. Intenta de nuevo.
fr: Échec de l'achat. Veuillez réessayer.
hi: खरीदारी विफल। कृपया पुनः प्रयास करें।
it: Acquisto fallito. Riprova.
ja: 購入に失敗しました。もう一度お試しください。
pt: Falha na compra. Tente novamente.
ru: Ошибка покупки. Попробуйте ещё раз.

# noPurchasesFound
source: No previous purchases found
de: Keine früheren Käufe gefunden
es: No se encontraron compras previas
fr: Aucun achat précédent trouvé
hi: कोई पिछली खरीदारी नहीं मिली
it: Nessun acquisto precedente trovato
ja: 以前の購入が見つかりません
pt: Nenhuma compra anterior encontrada
ru: Предыдущие покупки не найдены

source: Restore Purchases
de: Käufe wiederherstellen
es: Restaurar compras
fr: Restaurer les achats
hi: खरीदारी पुनर्स्थापित करें
it: Ripristina acquisti
ja: 購入を復元
pt: Restaurar compras
ru: Восстановить покупки

# proUpgradeHint
source: Upgrade to Pro for unlimited practice with all operators and no ads!
de: Upgrade auf Pro für unbegrenztes Üben mit allen Operatoren und ohne Werbung!
es: ¡Mejora a Pro para práctica ilimitada con todos los operadores y sin anuncios!
fr: Passez à Pro pour une pratique illimitée avec tous les opérateurs et sans publicités !
hi: सभी ऑपरेटरों और बिना विज्ञापनों के असीमित अभ्यास के लिए Pro में अपग्रेड करें!
it: Passa a Pro per pratica illimitata con tutti gli operatori e senza pubblicità!
ja: Proにアップグレードして、すべての演算子で無制限に練習し、広告なしで楽しもう！
pt: Atualize para Pro para prática ilimitada com todos os operadores e sem anúncios!
ru: Перейдите на Pro для безлимитной практики со всеми операторами и без рекламы!

# validationUnmatched
source: Unmatched parentheses
de: Klammern nicht geschlossen
es: Paréntesis sin cerrar
fr: Parenthèses non fermées
hi: कोष्ठक बंद नहीं हुए
it: Parentesi non chiuse
ja: 括弧が閉じていません
pt: Parênteses não fechados
ru: Незакрытые скобки

# validationMissingOperand
source: Missing operand
de: Operand fehlt
es: Falta un operando
fr: Opérande manquant
hi: ऑपरेंड गायब है
it: Operando mancante
ja: オペランドがありません
pt: Falta um operando
ru: Отсутствует операнд

# validationMissingOperator
source: Missing operator between variables
de: Operator zwischen Variablen fehlt
es: Falta un operador entre variables
fr: Opérateur manquant entre les variables
hi: चरों के बीच ऑपरेटर गायब है
it: Operatore mancante tra le variabili
ja: 変数間の演算子がありません
pt: Falta um operador entre variáveis
ru: Отсутствует оператор между переменными

# validationTrailingOp
source: Expression is incomplete
de: Ausdruck unvollständig
es: Expresión incompleta
fr: Expression incomplète
hi: अभिव्यक्ति अधूरी है
it: Espressione incompleta
ja: 式が不完全です
pt: Expressão incompleta
ru: Выражение неполное

# validationValid
source: Ready to evaluate
de: Bereit zur Auswertung
es: Lista para evaluar
fr: Prêt à évaluer
hi: मूल्यांकन के लिए तैयार
it: Pronta per la valutazione
ja: 評価準備完了
pt: Pronta para avaliar
ru: Готово к вычислению

source: Equivalence Checker
de: Äquivalenzprüfer
es: Verificador de Equivalencia
fr: Vérificateur d'Équivalence
hi: तुल्यता जाँचकर्ता
it: Verifica Equivalenza
ja: 等価性チェッカー
pt: Verificador de Equivalência
ru: Проверка Эквивалентности

source: Expression A
de: Ausdruck A
es: Expresión A
hi: अभिव्यक्ति A
it: Espressione A
ja: 式 A
pt: Expressão A
ru: Выражение A

source: Expression B
de: Ausdruck B
es: Expresión B
hi: अभिव्यक्ति B
it: Espressione B
ja: 式 B
pt: Expressão B
ru: Выражение B

source: Swap expressions
de: Ausdrücke tauschen
es: Intercambiar expresiones
fr: Échanger les expressions
hi: अभिव्यक्तियाँ बदलें
it: Scambia espressioni
ja: 式を入れ替え
pt: Trocar expressões
ru: Поменять выражения

source: Check Equivalence
de: Äquivalenz prüfen
es: Verificar Equivalencia
fr: Vérifier l'Équivalence
hi: तुल्यता जाँचें
it: Verifica Equivalenza
ja: 等価性を確認
pt: Verificar Equivalência
ru: Проверить Эквивалентность

# expressionsEquivalent
source: Equivalent ✅
de: Äquivalent ✅
es: Equivalentes ✅
fr: Équivalentes ✅
hi: तुल्य ✅
it: Equivalenti ✅
ja: 等価 ✅
pt: Equivalentes ✅
ru: Эквивалентны ✅

# expressionsNotEquivalent
source: Not Equivalent ❌
de: Nicht Äquivalent ❌
es: No Equivalentes ❌
fr: Non Équivalentes ❌
hi: तुल्य नहीं ❌
it: Non Equivalenti ❌
ja: 等価でない ❌
pt: Não Equivalentes ❌
ru: Не Эквивалентны ❌

# equivalentDescription
source: Both expressions produce the same truth values for all possible input combinations.
de: Beide Ausdrücke erzeugen die gleichen Wahrheitswerte für alle möglichen Eingabekombinationen.
es: Ambas expresiones producen los mismos valores de verdad para todas las combinaciones posibles.
fr: Les deux expressions produisent les mêmes valeurs de vérité pour toutes les combinaisons possibles.
hi: दोनों अभिव्यक्तियाँ सभी संभव इनपुट संयोजनों के लिए समान सत्य मान उत्पन्न करती हैं।
it: Entrambe le espressioni producono gli stessi valori di verità per tutte le combinazioni possibili.
ja: 両方の式は、すべての可能な入力の組み合わせに対して同じ真理値を生成します。
pt: Ambas as expressões produzem os mesmos valores de verdade para todas as combinações possíveis.
ru: Оба выражения дают одинаковые значения истинности для всех возможных комбинаций входных данных.

# notEquivalentDescription
source: They differ in {differing} of {total} rows ({pct}% match).
de: Sie unterscheiden sich in {differing} von {total} Zeilen ({pct}% stimmen überein).
es: Difieren en {differing} de {total} filas ({pct}% coinciden).
fr: Elles diffèrent dans {differing} sur {total} lignes ({pct}% correspondent).
hi: {total} में से {differing} पंक्तियों में भिन्नता ({pct}% मेल)।
it: Differiscono in {differing} su {total} righe ({pct}% corrispondono).
ja: {total} 行中 {differing} 行が異なります（{pct}% 一致）。
pt: Diferem em {differing} de {total} linhas ({pct}% coincidem).
ru: Различаются в {differing} из {total} строк ({pct}% совпадают).

# equivalenceError
source: Evaluation Error
de: Auswertungsfehler
es: Error de Evaluación
fr: Erreur d'Évaluation
hi: मूल्यांकन त्रुटि
it: Errore di Valutazione
ja: 評価エラー
pt: Erro de Avaliação
ru: Ошибка Вычисления

source: Comparison Table
de: Vergleichstabelle
es: Tabla Comparativa
fr: Tableau Comparatif
hi: तुलना तालिका
it: Tabella Comparativa
ja: 比較表
pt: Tabela Comparativa
ru: Сравнительная Таблица
