Repository: JovannyRch/tablas_de_verdad_2025
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, hi, it, ja, pt, ru

# adNotAvailable
source: Video not available. Try later or upgrade to Pro.
de: Video nicht verfügbar. Versuchen Sie es später erneut oder upgraden Sie auf Pro.
es: Video no disponible. Intenta más tarde o actualiza a Pro.
fr: Vidéo non disponible. Réessayez plus tard ou passez à Pro.
hi: वीडियो उपलब्ध नहीं है। बाद में प्रयास करें या Pro में अपग्रेड करें।
it: Video non disponibile. Riprova più tardi o passa a Pro.
ja: ビデオは利用できません。後でもう一度試すか、プロ版にアップグレードしてください。
pt: Vídeo não disponível. Tente mais tarde ou atualize para Pro.
ru: Видео недоступно. Попробуйте позже или перейдите на Pro.

source: Advanced mode
de: Erweiterter Modus
es: Modo avanzado
fr: Mode avancé
hi: उन्नत मोड
it: Modalità avanzata
ja: 高度なモード
pt: Modo avançado
ru: Расширенный режим

# appName
source: Truth Tables
de: Wahrheitstabellen
es: Tablas de Verdad
fr: Tables de Vérité
hi: सत्य तालिका
it: Tavole di Verità
ja: 真理値表
pt: Tabelas Verdade
ru: Таблицы Истинности

source: Ascending
de: Aufsteigend
es: Ascendente
fr: Ascendant
hi: आरोही
it: Crescente
ja: 昇順
pt: Ascendente
ru: По возрастанию

source: Appearance
de: Aussehen
es: Apariencia
fr: Apparence
hi: दिखावट
it: Aspetto
ja: 外観
pt: Aparência
ru: Внешний вид

source: About
de: Über
es: Acerca de
fr: À propos
hi: के बारे में
it: Informazioni
ja: アプリについて
pt: Sobre
ru: О программе

source: Become Pro!
de: Werden Sie Pro!
es: ¡Conviértete en Pro!
fr: Devenez Pro !
hi: Pro बनें!
it: Diventa Pro!
ja: プロになる！
pt: Torne-se Pro!
ru: Станьте Pro!

source: Clear all
de: Alles löschen
es: Borrar todo
fr: Tout effacer
hi: सभी साफ़ करें
it: Cancella tutto
ja: すべてクリア
pt: Limpar tudo
ru: Очистить всё

source: Close
de: Schließen
es: Cerrar
fr: Fermer
hi: बंद करें
it: Chiudi
ja: 閉じる
pt: Fechar
ru: Закрыть

# buyPro
source: Buy
de: Kaufen
es: Adquirir
fr: Acheter
hi: खरीदें
it: Acquista
ja: 購入
pt: Adquirir
ru: Купить

source: Calculation History
de: Berechnungsverlauf
es: Historial de cálculos
fr: Historique des calculs
hi: गणना इतिहास
it: Cronologia Calcoli
ja: 計算履歴
pt: Histórico de cálculos
ru: История вычислений

source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
hi: रद्द करें
it: Annulla
ja: キャンセル
pt: Cancelar
ru: Отмена

source: Contingency ⚠️
de: Kontingenz ⚠️
es: Contingencia ⚠️
fr: Contingence ⚠️
hi: आकस्मिकता ⚠️
it: Contingenza ⚠️
ja: 偶発的 ⚠️
pt: Contingência ⚠️
ru: Случайность ⚠️

# contingency_description
source: A contingency refers to a proposition or formula that is neither a tautology nor a contradiction. In other words, it is an expression that can be true or false, depending on the circumstances or the truth values of its components.
de: Eine Kontingenz bezieht sich auf eine Aussage oder Formel, die weder eine Tautologie noch ein Widerspruch ist. Mit anderen Worten, es ist ein Ausdruck, der wahr oder falsch sein kann, abhängig von den Umständen oder den Wahrheitswerten seiner Komponenten.
es: Una contingencia se refiere a una proposición o fórmula que no es ni una tautología ni una contradicción. En otras palabras, es una expresión que puede ser verdadera o falsa, dependiendo de las circunstancias o de los valores de verdad de sus componentes.
fr: Une contingence fait référence à une proposition ou formule qui n'est ni une tautologie ni une contradiction. En d'autres termes, c'est une expression qui peut être vraie ou fausse, selon les circonstances ou les valeurs de vérité de ses composants.
hi: एक आकस्मिकता एक प्रस्ताव या सूत्र को संदर्भित करती है जो न तो एक टॉटोलॉजी है और न ही एक विरोधाभास। दूसरे शब्दों में, यह एक अभिव्यक्ति है जो सत्य या असत्य हो सकती है, परिस्थितियों या इसके घटकों के सत्य मूल्यों के आधार पर।
it: Una contingenza si riferisce a una proposizione o formula che non è né una tautologia né una contraddizione. In altre parole, è un'espressione che può essere vera o falsa, a seconda delle circostanze o dei valori di verità dei suoi componenti.
ja: 偶発的とは、恒真式でも矛盾式でもない命題または式を指します。言い換えれば、状況またはその構成要素の真理値に応じて、真または偽になり得る表現です。
pt: Uma contingência refere-se a uma proposição ou fórmula que não é nem uma tautologia nem uma contradição. Em outras palavras, é uma expressão que pode ser verdadeira ou falsa, dependendo das circunstâncias ou dos valores de verdade de seus componentes.
ru: Случайность относится к утверждению или формуле, которая не является ни тавтологией, ни противоречием. Другими словами, это выражение, которое может быть истинным или ложным в зависимости от обстоятельств или значений истинности его компонентов.

source: Contradiction ❌
de: Widerspruch ❌
es: Contradicción ❌
hi: विरोधाभास ❌
it: Contraddizione ❌
ja: 矛盾 ❌
pt: Contradição ❌
ru: Противоречие ❌

# contradiction_description
source: A contradiction is a proposition or logical formula that is always false, regardless of the truth values of its components. In other words, it is an expression that does not hold under any interpretation or assignment of truth values to its variables.
de: Ein Widerspruch ist eine Aussage oder logische Formel, die immer falsch ist, unabhängig von den Wahrheitswerten ihrer Komponenten. Mit anderen Worten, es ist ein Ausdruck, der unter keiner Interpretation oder Zuweisung von Wahrheitswerten zu seinen Variablen gilt.
es: Una contradicción es una proposición o fórmula lógica que siempre es falsa, independientemente de los valores de verdad de sus componentes. En otras palabras, es una expresión que no se cumple bajo ninguna interpretación o asignación de valores de verdad a sus variables.
fr: Une contradiction est une proposition ou formule logique qui est toujours fausse, indépendamment des valeurs de vérité de ses composants. En d'autres termes, c'est une expression qui ne tient sous aucune interprétation ou attribution de valeurs de vérité à ses variables.
hi: एक विरोधाभास एक प्रस्ताव या तार्किक सूत्र है जो हमेशा असत्य होता है, इसके घटकों के सत्य मूल्यों की परवाह किए बिना। दूसरे शब्दों में, यह एक अभिव्यक्ति है जो इसके चर को सत्य मूल्यों की किसी भी व्याख्या या असाइनमेंट के तहत नहीं रखती है।
it: Una contraddizione è una proposizione o formula logica che è sempre falsa, indipendentemente dai valori di verità dei suoi componenti. In altre parole, è un'espressione che non è valida sotto nessuna interpretazione o assegnazione di valori di verità alle sue variabili.
ja: 矛盾とは、構成要素の真理値に関係なく常に偽である命題または論理式です。言い換えれば、変数への真理値の解釈または割り当てのいかなる場合でも成立しない表現です。
pt: Uma contradição é uma proposição ou fórmula lógica que é sempre falsa, independentemente dos valores de verdade de seus componentes. Em outras palavras, é uma expressão que não se mantém sob nenhuma interpretação ou atribuição de valores de verdade às suas variáveis.
ru: Противоречие - это утверждение или логическая формула, которая всегда ложна, независимо от значений истинности её компонентов. Другими словами, это выражение, которое не выполняется ни при какой интерпретации или присвоении значений истинности его переменным.

source: Dark mode
de: Dunkler Modus
es: Modo oscuro
fr: Mode sombre
hi: डार्क मोड
it: Modalità scura
ja: ダークモード
pt: Modo escuro
ru: Тёмный режим

source: Descending
de: Absteigend
es: Descendente
fr: Descendant
hi: अवरोही
it: Decrescente
ja: 降順
pt: Descendente
ru: По убыванию

# emptyExpression
source: Please enter a logical expression
de: Bitte geben Sie einen logischen Ausdruck ein
es: Por favor, ingresa una expresión lógica
fr: Veuillez saisir une expression logique
hi: कृपया एक तार्किक अभिव्यक्ति दर्ज करें
it: Inserisci un'espressione logica
ja: 論理式を入力してください
pt: Por favor, insira uma expressão lógica
ru: Пожалуйста, введите логическое выражение

source: Expression
de: Ausdruck
es: Expresión
hi: अभिव्यक्ति
it: Espressione
ja: 式
pt: Expressão
ru: Выражение

source: File Options
de: Dateioptionen
es: Opciones de archivo
fr: Options de fichier
hi: फ़ाइल विकल्प
it: Opzioni file
ja: ファイルオプション
pt: Opções do arquivo
ru: Опции файла

source: Open File
de: Datei öffnen
es: Abrir archivo
fr: Ouvrir le fichier
hi: फ़ाइल खोलें
it: Apri file
ja: ファイルを開く
pt: Abrir arquivo
ru: Открыть файл

source: Share File
de: Datei teilen
es: Compartir archivo
fr: Partager le fichier
hi: फ़ाइल साझा करें
it: Condividi file
ja: ファイルを共有
pt: Compartilhar arquivo
ru: Поделиться файлом

# shareFileMessage
source: I'm sharing this file with you.
de: Ich teile diese Datei mit dir.
es: Te comparto este archivo.
fr: Je partage ce fichier avec vous.
hi: मैं आपके साथ यह फ़ाइल साझा कर रहा हूँ।
it: Ti sto inviando questo file.
ja: このファイルを共有します。
pt: Estou enviando este arquivo para você.
ru: Я делюсь этим файлом с вами.

source: Expression Library
de: Ausdrucksbibliothek
es: Biblioteca de expresiones
fr: Bibliothèque d'expressions
hi: अभिव्यक्ति पुस्तकालय
it: Libreria Espressioni
ja: 式ライブラリ
pt: Biblioteca de expressões
ru: Библиотека выражений

# expressionsRemaining
source: {count} more expressions remaining
de: {count} weitere Ausdrücke verbleibend
es: Quedan {count} expresiones más
fr: {count} expressions supplémentaires restantes
hi: {count} और अधिक अभिव्यक्तियाँ शेष
it: {count} espressioni rimanenti
ja: 残り{count}個の式
pt: Restam {count} expressões a mais
ru: {count} выражений осталось

# fullFeatureAccess
source: Full access to all features
de: Vollzugriff auf alle Funktionen
es: Acceso completo a todas las funciones
fr: Accès complet à toutes les fonctionnalités
hi: सभी सुविधाओं तक पूर्ण पहुंच
it: Accesso completo a tutte le funzionalità
ja: すべての機能への完全アクセス
pt: Acesso completo a todos os recursos
ru: Полный доступ ко всем функциям

# fullLibraryAccess
source: Full access to expression library
de: Vollzugriff auf die Ausdrucksbibliothek
es: Acceso completo a la biblioteca de expresiones
fr: Accès complet à la bibliothèque d'expressions
hi: अभिव्यक्ति पुस्तकालय तक पूर्ण पहुंच
it: Accesso completo alla libreria espressioni
ja: 式ライブラリへの完全アクセス
pt: Acesso completo à biblioteca de expressões
ru: Полный доступ к библиотеке выражений

source: History
de: Verlauf
es: Historial
fr: Historique
hi: इतिहास
it: Cronologia
ja: 履歴
pt: Histórico
ru: История

source: Language
de: Sprache
es: Idioma
fr: Langue
hi: भाषा
it: Lingua
ja: 言語
pt: Idioma
ru: Язык

source: Later
de: Später
es: Más tarde
fr: Plus tard
hi: बाद में
it: Più tardi
ja: 後で
pt: Mais tarde
ru: Позже

# libraryUnlocked
source: 🎉 Complete library unlocked!
de: 🎉 Vollständige Bibliothek freigeschaltet!
es: 🎉 ¡Biblioteca completa desbloqueada!
fr: 🎉 Bibliothèque complète débloquée !
hi: 🎉 पूर्ण पुस्तकालय अनलॉक किया गया!
it: 🎉 Libreria completa sbloccata!
ja: 🎉 完全なライブラリがアンロックされました！
pt: 🎉 Biblioteca completa desbloqueada!
ru: 🎉 Полная библиотека разблокирована!

# mintermOrder
source: Order of minterms
de: Reihenfolge der Minterme
es: Orden de minterms
fr: Ordre des mintermes
hi: मिनटर्म का क्रम
it: Ordine dei mintermine
ja: 最小項の順序
pt: Ordem dos mintermos
ru: Порядок минтермов

source: more expressions
de: weitere Ausdrücke
es: expresiones más
fr: expressions supplémentaires
hi: और अधिक अभिव्यक्तियाँ
it: espressioni in più
ja: さらに式
pt: expressões a mais
ru: больше выражений

source: No ads
de: Keine Werbung
es: Sin anuncios
fr: Sans publicités
hi: कोई विज्ञापन नहीं
it: Nessuna pubblicità
ja: 広告なし
pt: Sem anúncios
ru: Без рекламы

source: No history
de: Kein Verlauf
es: No hay historial
fr: Aucun historique
hi: कोई इतिहास नहीं
it: Nessuna cronologia
ja: 履歴なし
pt: Sem histórico
ru: Нет истории

source: Number of propositions
de: Anzahl der Propositionen
es: Cantidad de proposiciones
fr: Nombre de propositions
hi: प्रस्तावों की संख्या
it: Numero di proposizioni
ja: 命題の数
pt: Número de proposições
ru: Количество утверждений

source: Number of rows
de: Anzahl der Zeilen
es: Cantidad de filas
fr: Nombre de lignes
hi: पंक्तियों की संख्या
it: Numero di righe
ja: 行数
pt: Número de linhas
ru: Количество строк

# only_tutorials
source: Show only tutorials
de: Nur Tutorials anzeigen
es: Solo mostrar tutoriales
fr: Afficher uniquement les tutoriels
hi: केवल ट्यूटोरियल दिखाएं
it: Mostra solo tutorial
ja: チュートリアルのみ表示
pt: Mostrar apenas tutoriais
ru: Показывать только учебники

# pdfFilename
source: truth_table
de: wahrheitstabelle
es: tabla_de_verdad
fr: table_verite
hi: satya_talika
it: tavola_verita
ja: 真理値表
pt: tabela_verdade
ru: tablica_istinnosti

source: Premium Operator
es: Operador Premium
fr: Opérateur Premium
hi: प्रीमियम ऑपरेटर
it: Operatore Premium
ja: プレミアム演算子
pt: Operador Premium
ru: Премиум оператор

# premiumOperatorMessage
source: This advanced operator requires watching a video or upgrading to Pro for unlimited access.
de: Dieser erweiterte Operator erfordert das Ansehen eines Videos oder ein Upgrade auf Pro für unbegrenzten Zugriff.
es: Este operador avanzado requiere ver un video o actualizar a Pro para acceso ilimitado.
fr: Cet opérateur avancé nécessite de regarder une vidéo ou de passer à Pro pour un accès illimité.
hi: इस उन्नत ऑपरेटर के लिए एक वीडियो देखना या असीमित पहुंच के लिए Pro में अपग्रेड करना आवश्यक है।
it: Questo operatore avanzato richiede la visione di un video o l'aggiornamento a Pro per l'accesso illimitato.
ja: この高度な演算子は、ビデオを視聴するか、無制限アクセスのためにプロ版にアップグレードする必要があります。
pt: Este operador avançado requer assistir a um vídeo ou atualizar para Pro para acesso ilimitado.
ru: Этот расширенный оператор требует просмотра видео или обновления до Pro для неограниченного доступа.

# premiumOperatorsAccess
source: Access to all premium operators
de: Zugriff auf alle Premium-Operatoren
es: Acceso a todos los operadores premium
fr: Accès à tous les opérateurs premium
hi: सभी प्रीमियम ऑपरेटरों तक पहुंच
it: Accesso a tutti gli operatori premium
ja: すべてのプレミアム演算子へのアクセス
pt: Acesso a todos os operadores premium
ru: Доступ ко всем премиум операторам

source: Preferences
de: Präferenzen
es: Preferencias
fr: Préférences
hi: पसंद
it: Preferenze
ja: 設定
pt: Preferências
ru: Предпочтения

source: Premium Support
es: Soporte Premium
fr: Support Premium
hi: प्रीमियम सहायता
it: Supporto Premium
ja: プレミアムサポート
pt: Suporte Premium
ru: Премиум поддержка

source: Privacy Policy
de: Datenschutzrichtlinie
es: Política de privacidad
fr: Politique de confidentialité
hi: गोपनीयता नीति
it: Informativa sulla Privacy
ja: プライバシーポリシー
pt: Política de privacidade
ru: Политика конфиденциальности

source: Propositions
de: Propositionen
es: Proposiciones
hi: प्रस्ताव
it: Proposizioni
ja: 命題
pt: Proposições
ru: Утверждения

source: Rate the app
de: App bewerten
es: Calificar la app
fr: Noter l'application
hi: ऐप को रेटिंग दें
it: Valuta l'app
ja: アプリを評価
pt: Avaliar o app
ru: Оценить приложение

# ratingDialogMessage
source: Your opinion is very important to us! If you enjoyed Truth Tables, we would love for you to leave us a 5-star rating ⭐
de: Ihre Meinung ist uns sehr wichtig! Wenn Ihnen Wahrheitstabellen gefallen hat, würden wir uns freuen, wenn Sie uns eine 5-Sterne-Bewertung geben ⭐
es: ¡Tu opinión es muy importante para nosotros! Si te ha gustado Tablas de Verdad, nos encantaría que nos dejaras una calificación de 5 estrellas ⭐
fr: Votre avis est très important pour nous ! Si vous avez aimé Tables de Vérité, nous aimerions que vous nous laissiez une note de 5 étoiles ⭐
hi: आपकी राय हमारे लिए बहुत महत्वपूर्ण है! यदि आपको सत्य तालिका पसंद आई, तो हम चाहेंगे कि आप हमें 5-स्टार रेटिंग दें ⭐
it: La tua opinione è molto importante per noi! Se ti è piaciuta Tavole di Verità, ci piacerebbe che lasciassi una recensione a 5 stelle ⭐
ja: あなたの意見は私たちにとって非常に重要です！真理値表を気に入っていただけた場合は、5つ星の評価を残していただければ幸いです ⭐
pt: Sua opinião é muito importante para nós! Se você gostou do Tabelas Verdade, adoraríamos que você nos deixasse uma avaliação de 5 estrelas ⭐
ru: Ваше мнение очень важно для нас! Если вам понравились Таблицы Истинности, мы будем рады, если вы оставите нам 5-звёздочный рейтинг ⭐

# ratingDialogTitle
source: Enjoying the app?
de: Gefällt Ihnen die App?
es: ¿Te gusta la app?
fr: Vous aimez l'application ?
hi: ऐप पसंद आया?
it: Ti piace l'app?
ja: アプリを楽しんでいますか？
pt: Gostando do app?
ru: Нравится приложение?

# ratingLater
source: Later
de: Später
es: Más tarde
fr: Plus tard
hi: बाद में
it: Più tardi
ja: 後で
pt: Mais tarde
ru: Позже

# ratingNoThanks
source: No, thanks
de: Nein, danke
es: No, gracias
fr: Non, merci
hi: नहीं, धन्यवाद
it: No, grazie
ja: いいえ、結構です
pt: Não, obrigado
ru: Нет, спасибо

# ratingRateNow
source: Rate now!
de: Jetzt bewerten!
es: ¡Calificar ahora!
fr: Noter maintenant !
hi: अभी रेटिंग दें!
it: Valuta ora!
ja: 今すぐ評価！
pt: Avaliar agora!
ru: Оценить сейчас!

# remainingExpressions
source: Remaining
de: Verbleibend
es: Quedan
fr: Restant
hi: शेष
it: Rimanenti
ja: 残り
pt: Restam
ru: Осталось

# resetDefaults
source: Reset to Defaults
de: Auf Standardeinstellungen zurücksetzen
es: Restablecer valores predeterminados
fr: Réinitialiser aux paramètres par défaut
hi: डिफ़ॉल्ट पर रीसेट करें
it: Ripristina impostazioni predefinite
ja: デフォルトにリセット
pt: Redefinir para os padrões
ru: Сбросить настройки

source: Confirm Reset
de: Zurücksetzen bestätigen
es: Confirmar restablecimiento
fr: Confirmer la réinitialisation
hi: रीसेट की पुष्टि करें
it: Conferma ripristino
ja: リセットの確認
pt: Confirmar redefinição
ru: Подтвердить сброс

# confirmResetDesc
source: Are you sure you want to reset all settings to their defaults?
de: Sind Sie sicher, dass Sie alle Einstellungen auf die Standardwerte zurücksetzen möchten?
es: ¿Estás seguro de que quieres restablecer todos los ajustes a sus valores predeterminados?
fr: Êtes-vous sûr de vouloir réinitialiser tous les paramètres par défaut ?
hi: क्या आप वाकई सभी सेटिंग्स को उनके डिफ़ॉल्ट पर रीसेट करना चाहते हैं?
it: Sei sicuro di voler ripristinare tutte le impostazioni ai valori predefiniti?
ja: すべての設定をデフォルトに戻してもよろしいですか？
pt: Tem certeza de que deseja redefinir todas as configurações para os padrões?
ru: Вы уверены, что хотите сбросить все настройки до значений по умолчанию?

source: OK
es: Aceptar
hi: ठीक है
ru: ОК

source: Result
de: Ergebnis
es: Resultado
fr: Résultat
hi: परिणाम
it: Risultato
ja: 結果
pt: Resultado
ru: Результат

source: Settings
de: Einstellungen
es: Configuraciones
fr: Paramètres
hi: सेटिंग्स
it: Impostazioni
ja: 設定
pt: Configurações
ru: Настройки

# settingsTitle
source: Settings
de: Einstellungen
es: Configuraciones
fr: Paramètres
hi: सेटिंग्स
it: Impostazioni
ja: 設定
pt: Configurações
ru: Настройки

# settings_mode
source: Mode
de: Modus
es: Modo
hi: मोड
it: Modalità
ja: モード
pt: Modo
ru: Режим

source: Simple mode
de: Einfacher Modus
es: Modo simple
fr: Mode simple
hi: सरल मोड
it: Modalità semplice
ja: シンプルモード
pt: Modo simples
ru: Простой режим

# steps
source: Resolution steps
de: Lösungsschritte
es: Pasos de resolución
fr: Étapes de résolution
hi: समाधान के कदम
it: Passaggi di risoluzione
ja: 解決の手順
pt: Passos de resolução
ru: Шаги решения

# more_info
source: More information
de: Mehr Informationen
es: Más información
fr: Plus d'informations
hi: अधिक जानकारी
it: Ulteriori informazioni
ja: 詳細情報
pt: Mais informações
ru: Дополнительная информация

source: T/F
de: W/F
es: V/F
fr: V/F
hi: S/A
it: V/F
ja: 真/偽
pt: V/F
ru: И/Л

source: Tautology ✅
de: Tautologie ✅
es: Tautología ✅
fr: Tautologie ✅
hi: टॉटोलॉजी ✅
it: Tautologia ✅
ja: 恒真式 ✅
pt: Tautologia ✅
ru: Тавтология ✅

# tautology_description
source: A tautology is a proposition or logical formula that is always true, regardless of the truth values of its components. In other words, it is an expression that holds under any interpretation or assignment of truth values to its variables.
de: Eine Tautologie ist eine Aussage oder logische Formel, die immer wahr ist, unabhängig von den Wahrheitswerten ihrer Komponenten. Mit anderen Worten, es ist ein Ausdruck, der unter jeder Interpretation oder Zuweisung von Wahrheitswerten zu seinen Variablen gilt.
es: Una tautología es una proposición o fórmula lógica que siempre es verdadera, independientemente de los valores de verdad de sus componentes. En otras palabras, es una expresión que se cumple bajo cualquier interpretación o asignación de valores de verdad a sus variables.
fr: Une tautologie est une proposition ou formule logique qui est toujours vraie, indépendamment des valeurs de vérité de ses composants. En d'autres termes, c'est une expression qui tient sous toute interprétation ou attribution de valeurs de vérité à ses variables.
hi: एक टॉटोलॉजी एक प्रस्ताव या तार्किक सूत्र है जो हमेशा सत्य होता है, इसके घटकों के सत्य मूल्यों की परवाह किए बिना। दूसरे शब्दों में, यह एक अभिव्यक्ति है जो इसके चर को सत्य मूल्यों की किसी भी व्याख्या या असाइनमेंट के तहत रखती है।
it: Una tautologia è una proposizione o formula logica che è sempre vera, indipendentemente dai valori di verità dei suoi componenti. In altre parole, è un'espressione che è valida sotto qualsiasi interpretazione o assegnazione di valori di verità alle sue variabili.
ja: 恒真式とは、構成要素の真理値に関係なく常に真である命題または論理式です。言い換えれば、変数への真理値の解釈または割り当てのいかなる場合でも成立する表現です。
pt: Uma tautologia é uma proposição ou fórmula lógica que é sempre verdadeira, independentemente dos valores de verdade de seus componentes. Em outras palavras, é uma expressão que se mantém sob qualquer interpretação ou atribuição de valores de verdade às suas variáveis.
ru: Тавтология - это утверждение или логическая формула, которая всегда истинна, независимо от значений истинности её компонентов. Другими словами, это выражение, которое выполняется при любой интерпретации или присвоении значений истинности его переменным.

source: Truth values
de: Wahrheitswerte
es: Valores de verdad
fr: Valeurs de vérité
hi: सत्य मान
it: Valori di verità
ja: 真理値
pt: Valores de verdade
ru: Значения истинности

source: Tutorials
es: Tutoriales
fr: Tutoriels
hi: ट्यूटोरियल
it: Tutorial
ja: チュートリアル
pt: Tutoriais
ru: Учебники

source: Type
de: Typ
es: Tipo
hi: प्रकार
it: Tipo
ja: タイプ
pt: Tipo
ru: Тип

# unlockFullLibrary
source: Unlock the complete library!
de: Schalten Sie die vollständige Bibliothek frei!
es: ¡Desbloquea la biblioteca completa!
fr: Débloquez la bibliothèque complète !
hi: पूर्ण पुस्तकालय अनलॉक करें!
it: Sblocca la libreria completa!
ja: 完全なライブラリをアンロック！
pt: Desbloqueie a biblioteca completa!
ru: Разблокируйте полную библиотеку!

# unlockLibraryTitle
source: 🎯 Unlock the complete library!
de: 🎯 Schalten Sie die vollständige Bibliothek frei!
es: 🎯 ¡Desbloquea la biblioteca completa!
fr: 🎯 Débloquez la bibliothèque complète !
hi: 🎯 पूर्ण पुस्तकालय अनलॉक करें!
it: 🎯 Sblocca la libreria completa!
ja: 🎯 完全なライブラリをアンロック！
pt: 🎯 Desbloqueie a biblioteca completa!
ru: 🎯 Разблокируйте полную библиотеку!

# upgradePro
source: Upgrade to Pro
de: Auf Pro upgraden
es: Actualizar a Pro
fr: Passer à Pro
hi: Pro में अपग्रेड करें
it: Passa a Pro
ja: プロ版にアップグレード
pt: Atualizar para Pro
ru: Обновить до Pro

# videoFABLabel
source: Watch video
de: Video ansehen
es: Ver video
fr: Voir la vidéo
hi: वीडियो देखें
it: Guarda video
ja: ビデオを見る
pt: Ver vídeo
ru: Смотреть видео

# videoFABTooltip
source: Video explanation
de: Videoerklärung
es: Explicación en video
fr: Explication vidéo
hi: वीडियो स्पष्टीकरण
it: Spiegazione video
ja: ビデオ説明
pt: Explicação em vídeo
ru: Видео объяснение

# videoScreenDescription
source: This video explains the step-by-step resolution of this logical expression.
de: Dieses Video erklärt Schritt für Schritt die Lösung dieses logischen Ausdrucks.
es: Este video explica paso a paso la resolución de esta expresión lógica.
fr: Cette vidéo explique étape par étape la résolution de cette expression logique.
hi: यह वीडियो इस तार्किक अभिव्यक्ति के समाधान को चरण-दर-चरण समझाता है।
it: Questo video spiega la risoluzione passo dopo passo di questa espressione logica.
ja: このビデオは、この論理式の段階的な解法を説明します。
pt: Este vídeo explica passo a passo a resolução desta expressão lógica.
ru: Это видео пошагово объясняет решение этого логического выражения.

# videoScreenTitle
source: Video Explanation
de: Videoerklärung
es: Explicación en video
fr: Explication vidéo
hi: वीडियो स्पष्टीकरण
it: Spiegazione Video
ja: ビデオ説明
pt: Explicação em vídeo
ru: Видео объяснение
